"""
для to_thread() подходят только настоящие I/O операции:

Файловые операции (чтение/запись)
Сетевые запросы
Операции с базами данных
Пользовательский ввод/вывод
Любые другие операции, где есть ожидание внешнего ресурса
"""

import asyncio

# Синхронная функция получить строку от пользователя
def get_user_input():
    return input("Введите текст: ")

# Асинхронная функция которая использует to_thread для запуска синхронной функции в отдельном потоке

async def test_input():
    task = asyncio.to_thread(get_user_input)
    print("Пока вы думаете...")
    print("Код продолжает работать...")
    
    result = await task
    print(f"Вы ввели: {result}")


asyncio.run(test_input())