"""
24.12.2024
Урок 21. Области видимости. Замыкания. Декораторы
- 4 Области видимости в Python
"""

# Области видимости в Python

 
# 1. Глобальная область видимости
# 2. Локальная область видимости
# 3. Нелокальная область видимости

a = 1

def my_func2():
    a = 2  # Локальная область видимости функции my_func2
    print(f"Переменная {a=} в функции my_func2 до inner_func")

    def inner_func():
        # nonlocal a
        a = 3  # Локальная область видимости функции inner_func
        print(f'Переменная {a=} в функции inner_func')

    inner_func()
    print(f"Переменная {a=} в функции my_func2 после inner_func")


my_func2()
print(f"Переменная {a=} в глобальной области видимости")