"""
Тема: ООП Ч5. Наследование. Abstractmethod. Super. Переопределение и расширение. Урок: 28
- Абстрактные классы и методы
- Иерархическое наследование (вертикальное) - на примере мопса
"""

#PRACTICE
"""
класс - большая матрешка
- атрибут класса - счетчик выпущенных экземпляров
- атрибут экземпляра - ID экземпляра

класс - средняя матрешка
- атрибут класса - счетчик выпущенных экземпляров
- атрибут экземпляра - Большая матрешка

класс - маленькая матрешка
- атрибут экземпляра - ID экземпляра
- атрибут экземпляра - средняя матрешка

Иерархическое наследование

создавая маленькую матрешку, мы создаем весь комплект


возможно создадим миксины 
Чтобы можно было делать матрешки из разных материлов и разных коллекций
"""