"""
24.12.2024
Урок 21. Области видимости. Замыкания. Декораторы
- 4 Области видимости в Python
"""

# Области видимости в Python

 
# 1. Глобальная область видимости
# 2. Локальная область видимости
# 3. Нелокальная область видимости

# print(a) # NameError: name 'a' is not defined

# 0. Встроенная область видимости
# Встроенные функции, классы, исключения

# print = "Эльф"
# print("Hello")

# Мы сломали принт. Потому что Python ищет имя print в глобальной области видимости. И найдет. И это будет строка.
# Во встроенную область видимости он не пойдет.

# 2. Локальная область видимости. Область видимости внутри функции

a = 2  # Глобальная область видимости
b = 4  # Глобальная область видимости


def my_func():
    a = 3  # Локальная область видимости функции my_func
    print(f'Переменная {a=} в функции')
    print(f'Переменная {b=} в функции')
    return a

my_func()
print(f"Переменная {a=} в глобальной области видимости")
