"""
Lesson 27
23.01.2025

ООП. Инкапсуляция. Продолжение.
- Класс "Шифр Цезаря" основанный на сдвиге по таблице кодирования UTF-8
- ord() - возвращает код символа в таблице UTF-8
- chr() - возвращает символ по коду в таблице UTF-8

Employee и  Organisaton как пример взаимодействия классов
Класс ManagerEmployee и потребность в наследовании при незначительных вариациях логики и атрибутов
Базовый пример наследования в коде. DRY - избегаем повторения кода (а так же сложных аннотаций типов)
Animal и Dog базовый вариант наследования
self.__class__.__name__
"""

class Animal:
    def voise(self):
        # self. - экземпляр
        # __class__ обращение к своему классу
        # __name__ получение имени класса в виде строки
        print(f"{self.__class__.__name__} подаёт голос")


class Dog(Animal):
    pass


dog = Dog()
animal = Animal()
dog.voise() # Dog подает голос
animal.voise() # Animal подает голос
