"""
Урок 17

10.12.2024

Python: Работа с файлами TXT JSON конфигурация приложений. Урок: 17

1. Основы работы с файлами:
    - Кодировки файлов (UTF-8, ASCII, CP1251)
    - Функция open() и её параметры
    - Функция close()
    - Режимы работы с файлами (r, w, a, b)
    - Контекстный менеджер with
    - Методы read(), write(), readlines()

2. Работа с различными форматами:
    - Текстовые файлы (txt)
    - JSON файлы и модуль json
    - YAML файлы и модуль PyYAML
    - CSV файлы и модуль csv
    - Сравнение форматов для хранения конфигурации

3. Создание конфигурации приложения:
    - Структура конфигурационного файла
    - Реализация конфига в YAML
    - Валидация конфигурации
    - Обработка ошибок при чтении конфига

4. Упаковка приложения с внешней конфигурацией:
    - Структура проекта с внешним конфигом
    - Настройка PyInstaller
    - Размещение конфига рядом с exe
    - Относительные пути в приложении

5. Практика:
    - Создание приложения с внешним YAML-конфигом
    - Реализация чтения/записи всех изученных форматов
    - Обработка различных кодировок
    - Сборка финального приложения с внешней конфигурацией
"""



def read_file(file_path: str, encoding: str = 'utf-8') -> str:
    """
    Читает содержимое текстового файла и возвращает его в виде строки.
    Args:
        file_path (str): Путь к файлу для чтения
        encoding (str, optional): Кодировка файла. По умолчанию 'utf-8'
    """
    with open(file_path, 'r', encoding=encoding) as file:
        text = file.read()
    return text


def write_file(file_path: str, text: str, encoding: str = 'utf-8', mode: str = 'w') -> None:
    """
    Записывает текст в файл. Автоматически добавляет перенос строки в конце.
    Флаг по умолчанию - 'w'
    Args:
        file_path (str): Путь к файлу для записи
        text (str): Текст для записи в файл
        encoding (str, optional): Кодировка файла. По умолчанию 'utf-8'
        mode (str, optional): Режим открытия файла ('w' - перезапись, 'a' - дозапись). По умолчанию 'w'
    """
    with open(file_path, mode, encoding=encoding) as file:
        file.write(text + '\n')


# Тестируем
# Запись в файл
TXT_FILE = r'./lesson_17/lesson_17_test.txt'
# write_file(TXT_FILE, 'Тест функции', mode='a')
# Чтение из файла
# text = read_file(TXT_FILE)
# print(text)


# Контекстный менеджер  with
with open(TXT_FILE, 'r', encoding='utf-8') as file:
    text = file.read()


print(text)